{
    "Chest": [
      {
        "Name": "Heart of the Lion",
        "Description": "The hunter invokes the heart of a lion, increasing total stats by 10% for all nearby allies, and increasing total stats for the Hunter by an additional 10%.",
        "icon": "ability_hunter_pet_cat"
      },
      {
        "Name": "Master Marksman",
        "Description": "Increases your critical strike chance by 5%, and reduces the Mana cost of all your Shot abilities by 25%.",
        "icon": "ability_hunter_mastermarksman"
      },
      {
        "Name": "Lone Wolf",
        "Description": "You deal 30% increased damage with all attacks while you do not have an active pet.",
        "icon": "ability_mount_whitedirewolf"
      },
      {
        "Name": "Cobra Strikes",
        "Description": "Your critical hits with Shot abilities cause your pet's next 2 special attacks to critically hit.",
        "icon": "ability_hunter_cobrastrikes"
      }
    ],
    "Waist": [
      {
        "Name": "Melee Specialist",
        "Description": "Raptor Strike cooldown reduced to 3 sec and is now instant, Mongoose Bite cooldown removed, and Raptor Strike has a 30% chance on each attack not to trigger its cooldown.",
        "icon": "inv_axe_03"
      },
      {
        "Name": "Steady Shot",
        "Description": "A steady shot that causes 75% ranged weapon damage.",
        "icon": "ability_hunter_steadyshot"
      },
      {
        "Name": "Expose Weakness",
        "Description": "Your melee and ranged criticals increase your attack power by 40% of your current Agility for 7 sec.",
        "icon": "ability_rogue_findweakness"
      }
    ],
    "Legs": [
      {
        "Name": "Kill Command",
        "Description": "Give the command to kill, increasing your pet's damage done from Claw and Bite by 60% for 30 sec. Each Claw or Bite done by the pet reduces the damage bonus by 20%.",
        "icon": "ability_hunter_killcommand"
      },
      {
        "Name": "Sniper Training",
        "Description": "Your Shot abilities gain 2% increased critical strike chance while you have not moved for the last 2 sec, stacking every sec up to 5 times. While moving, you will lose 1 stack per sec.",
        "icon": "ability_hunter_longshots"
      },
      {
        "Name": "Serpent Spread",
        "Description": "Targets hit by your Multi-Shot are also afflicted by your Serpent Sting for 6 sec.",
        "icon": "ability_hunter_serpentswiftness"
      },
      {
        "Name": "Flanking Strike",
        "Description": "You and your pet deal simultaneous instant 100% melee damage. Afterward, your Mongoose Bite and Raptor Strike deal 10% increased damage for 10 sec, stacking up to 3 times. Raptor Strike has a 20% chance to reset the cooldown on Flanking Strike.",
        "icon": "ability_hunter_harass"
      }
    ],
    "Feet": [
      {
        "Name": "Trap Launcher",
        "Description": "Your Traps can now be placed at any location within 35 yards, and can be placed while you are in combat. Additionally, your Fire-based and Frost-based traps now have separate shared cooldowns.",
        "icon": "ability_hunter_resourcefulness"
      },
      {
        "Name": "Dual Wield Specialization",
        "Description": "Increases the damage done by your offhand weapon by 50% and causes your Raptor Strike to strike with both weapons when you are dual-wielding.",
        "icon": "ability_dualwield"
      },
      {
        "Name": "Invigoration",
        "Description": "When your pet scores a critical hit with a special ability, you instantly regenerate 5% of your maximum mana.",
        "icon": "ability_hunter_invigeration"
      }
    ],
    "Hands": [
      {
        "Name": "Beast Mastery",
        "Description": "Your pet's damage and health are increased by 20%, and its Focus regeneration by 50%. In addition, your pet's Growl now also Taunts the target to attack it for 3 sec.",
        "icon": "ability_physical_taunt"
      },
      {
        "Name": "Chimera Shot",
        "Description": "You deal 120% weapon damage, refreshing the current Sting on your target and triggering an effect:\n\nSerpent Sting - Instantly deals 48% of the damage done by your Serpent Sting.\n\nViper Sting - Instantly restores mana to you equal to 60% of the total amount drained by your Viper Sting.\n\nScorpid Sting - Attempts to Disarm the target for 10 sec. This effect cannot occur more than once per 1 minute.",
        "icon": "ability_hunter_chimerashot2"
      },
      {
        "Name": "Explosive Shot",
        "Description": "You fire an explosive charge into the enemy target, dealing 74-101 Fire damage to all enemies within 8 yards. The charge will deal damage again every second for an additional 2 sec.",
        "icon": "ability_hunter_explosiveshot"
      },
      {
        "Name": "Carve",
        "Description": "A sweeping attack that strikes all enemies in front of you for 65% weapon damage.",
        "icon": "inv_throwingknife_06"
      }
    ],
    "Head (Phase 3)": [
      {
        "Name": "Lock and Load",
        "Description": "Each time one of your traps is triggered, your next Shot ability within 20 sec costs no mana and does not incur a cooldown.",
        "icon": "ability_hunter_lockandload"
      },
      {
        "Name": "Catlike Reflexes",
        "Description": "Increases your chance to dodge by 20% and your pet's chance to dodge by 9%. In addition, reduces the cooldown of your Kill Command and Flanking Strike abilities by 50%.",
        "icon": "ability_hunter_catlikereflexes"
      },
      {
        "Name": "Rapid Killing",
        "Description": "Reduces the cooldown on Rapid Fire by 2 min, and your next Shot ability within 20 sec after killing a target worth experience or honor deals 20% increased damage.",
        "icon": "ability_hunter_rapidkilling"
      }
    ],
    "Wrists (Phase 3)": [
      {
        "Name": "Focus Fire",
        "Description": "Consumes all applications of Frenzy from your pet, increasing your ranged attack speed by 3% and granting 4 Focus to your pet for each application of Frenzy consumed. Lasts 20 sec.\n\nYour pet gains Frenzy each time it uses a Basic Attack, increasing its melee attack speed by 6% for 10 sec, stacking up to 5 times.",
        "icon": "inv_weapon_crossbow_19"
      },
      {
        "Name": "T.N.T.",
        "Description": "Increases the damage done by Explosive Shot and all your damaging traps by 10%.",
        "icon": "inv_misc_bomb_05"
      },
      {
        "Name": "Raptor Fury",
        "Description": "Raptor Strike increases damage done by Raptor Strike and Mongoose Bite by 15% for 15 sec, stacking up to 5 times. Subsequent doses do not extend the duration of this effect.",
        "icon": "ability_mount_raptor"
      }
    ]
  }