{
    "Chest": [
      {
        "Name": "Enlightenment",
        "Description": "You deal 10% more damage while you have more than 70% mana. While below 30% mana 10% of your mana regeneration continues while casting.",
        "icon": "spell_arcane_mindmastery"
      },
      {
        "Name": "Burnout",
        "Description": "Increases your spell critical strike chance with all spells by 15%, but your non-periodic spell critical strikes now have an additional mana cost of 1% of your base mana.",
        "icon": "ability_mage_burnout"
      },
      {
        "Name": "Fingers of Frost",
        "Description": "Gives your Chill effects a 15% chance to grant you the Fingers of Frost effect, which treats your next 2 spells cast as if the target were Frozen. Lasts 15 sec.",
        "icon": "ability_mage_wintersgrasp"
      },
      {
        "Name": "Regeneration",
        "Description": "Heals the target for 848 health over 3 sec and applies Temporal Beacon for 30 sec. Temporal Beacon Records the subject's space-time position. 80% of all Arcane damage done by the caster will be converted to chronomantic healing on each of the caster's current Temporal Beacon targets. This healing is reduced by 50% on self, and also reduced by 80% when damage is done by Arcane spells that damage multiple targets.",
        "icon": "inv_enchant_essencemysticalsmall"
      }
    ],
    "Waist": [
      {
        "Name": "Missile Barrage",
        "Description": "Gives your Arcane Blast a 40% chance, and your Fireball, Frostbolt, Frostfire Bolt, and Spellfrost Bolt spells a 20% chance to reduce the channeled duration of your next Arcane Missiles spell by 50%, reduce the mana cost by 100%, and missiles will fire every 0.5 secs.",
        "icon": "ability_mage_missilebarrage"
      },
      {
        "Name": "Hot Streak",
        "Description": "Any time you score 2 non-periodic spell criticals in a row using Fireball, Fire Blast, Scorch, or Living Bomb, your next Pyroblast spell cast within 10 sec will be instant cast.",
        "icon": "ability_mage_hotstreak"
      },
      {
        "Name": "Frostfire Bolt",
        "Description": "Launches a bolt of frostfire at the enemy, causing 673 to 784 Frostfire damage, slowing movement speed by 40% and causing an additional 63 Frostfire damage over 9 sec. This spell will be checked against the lower of the target's Frost and Fire resists and counts as both Frost and Fire damage.",
        "icon": "ability_mage_frostfirebolt"
      },
      {
        "Name": "Spellfrost Bolt",
        "Description": "Launches a bolt of spellfrost at the enemy, causing 530 to 617 Spellfrost damage and slowing movement speed by 40% for 9 sec. This spell will be checked against the lower of the target's Frost and Arcane resists and counts as both Frost and Arcane damage.",
        "icon": "spell_fire_blueflamebolt"
      }
    ],
    "Legs": [
      {
        "Name": "Icy Veins",
        "Description": "Hastens your spellcasting, increasing spell casting speed by 20% and reduces the pushback suffered from damaging attacks while casting by 100%. Lasts 20 sec.",
        "icon": "spell_frost_coldhearted"
      },
      {
        "Name": "Arcane Surge",
        "Description": "Unleash all of your remaining mana in a surge of energy focused at the target dealing 393 to 459 Arcane damage, increased by up to 300% based on your mana remaining. Afterward, your normal mana regeneration is activated and increased by 300% for 8 sec.",
        "icon": "spell_arcane_arcanetorrent"
      },
      {
        "Name": "Mass Regeneration",
        "Description": "Heals all of target player's party members within 30 yards of target player for 848 health over 3 sec and applies Temporal Beacon to each target for 15 sec. Temporal Beacon Records the subject's space-time position. 80% of all Arcane damage done by the caster will be converted to chronomantic healing on each of the caster's current Temporal Beacon targets. This healing is reduced by 50% on self, and also reduced by 80% when damage is done by Arcane spells that damage multiple targets.",
        "icon": "inv_enchant_essencemysticallarge"
      },
      {
        "Name": "Living Flame",
        "Description": "Summons a spellfire flame that moves toward the target, leaving a trail of spellfire. This trail deals 174 Spellfire damage every second to nearby enemies. Lasts 10 sec.",
        "icon": "spell_fire_masterofelements"
      }
    ],
    "Feet": [
      {
        "Name": "Chronostatic Preservation",
        "Description": "Fuses Arcane, Fire, and Frost magic to freeze chronomantic energy into a stored state for later use. You can hold this energy for up to 20 sec before it combusts and expires. When unleashed, heals a friendly target for 1,346 to 2,020. This spell is considered Arcane, Fire, and Frost for interactions with other spells, talents, and effects.",
        "icon": "spell_arcane_arcane02"
      },
      {
        "Name": "Brain Freeze",
        "Description": "Your Frost damage spells with chilling effects have a 15% chance to cause your next Fireball, Spellfrost Bolt, or Frostfire Bolt spell to be instant cast and cost no mana.",
        "icon": "ability_mage_brainfreeze"
      },
      {
        "Name": "Spell Power",
        "Description": "Increases critical strike damage bonus of all spells by 50%.",
        "icon": "spell_holy_mindvision"
      }
    ],
    "Hands": [
      {
        "Name": "Rewind Time",
        "Description": "Your current target with your Temporal Beacon instantly heals all damage taken over the last 5 seconds. Ineffective on targets that did not have a Temporal Beacon 5 seconds ago.",
        "icon": "spell_holy_borrowedtime"
      },
      {
        "Name": "Living Bomb",
        "Description": "The target becomes a Living Bomb, taking 591 Fire damage over 12 sec. After 12 sec or when the spell is dispelled, the target explodes dealing 297 Fire damage to all enemies within 10 yards",
        "icon": "ability_mage_livingbomb"
      },
      {
        "Name": "Arcane Blast",
        "Description": "Blasts the target with energy, dealing 787 to 916 Arcane damage. Each time you cast Arcane Blast, the damage and healing of all other Arcane spells is increased by 15% and mana cost of Arcane Blast is increased by 175%. Effect stacks up to 4 times and lasts 6 sec or until any other Arcane damage or healing spell is cast.",
        "icon": "spell_arcane_blast"
      },
      {
        "Name": "Ice Lance",
        "Description": "Deals 96 to 113 Frost damage to an enemy target. Causes triple damage against Frozen targets.",
        "icon": "spell_frost_frostblast"
      }
    ],
    "Head (Phase 3)": [
      {
        "Name": "Deep Freeze",
        "Description": "Stuns the target for 5 sec. Only usable on Frozen targets. Deals 803 to 935 damage to targets permanently immune to Stun.",
        "icon": "ability_mage_deepfreeze"
      },
      {
        "Name": "Temporal Anomaly",
        "Description": "Launches an orb of temporal energy which slowly moves forward and every 2 sec grants all nearby party members a shield absorbing 174 damage for 15 sec.",
        "icon": "spell_fire_blueflamering"
      },
      {
        "Name": "Advanced Warding",
        "Description": "Increases the magnitude of your Mana Shield, Frost Ward, and Fire Ward by 100%, and decreases mana drained by Mana Shield by 50% per damage done.",
        "icon": "spell_arcane_arcaneresilience"
      }
    ],
    "Wrists (Phase 3)": [
      {
        "Name": "Molten Armor",
        "Description": "Causes 17 Fire damage when hit, increases your spell critical strike chance by 5%, and reduces the chance you are critically hit by 5%. Only one type of Armor spell can be active on the Mage at any time. Lasts 30 min.",
        "icon": "ability_mage_moltenarmor"
      },
      {
        "Name": "Displacement",
        "Description": "Teleports back to where you last cast Blink from and resets the cooldown on Blink. Only usable within 10 sec of casting Blink.",
        "icon": "ability_hunter_displacement"
      },
      {
        "Name": "Balefire Bolt",
        "Description": "Unleash a reality-distorting burst of raw magic at your enemy, dealing 487 to 730 Spellfire damage. Each time you cast Balefire Bolt, the damage of your next Balefire Bolt within 30 sec will be increased by 10% and your Spirit will be decreased by 10% for 30 sec, both stacking up to 10 times. If your Spirit reaches 0 as consequence, you will immediately die. This spell will be checked against the lower of the target's Arcane and Fire resists.",
        "icon": "spell_fire_firebolt"
      }
    ]
  }