{
    "Chest": [
      {
        "Name": "Deadly Brew",
        "Description": "Grants several improvements to your poisons:\n\nWhen you inflict any other poison on a target, you also inflict Deadly Poison.\n\nIf your weapon does not have a poison applied, it has a chance to trigger Instant Poison as if Instant Poison were applied.\n\nDeadly Poison and Instant Poison now gain increased damage from your Attack Power.",
        "icon": "ability_rogue_deadlybrew"
      },
      {
        "Name": "Just a Flesh Wound",
        "Description": "You take 20% reduced Physical damage while Blade Dance is active. Additionally, you have 6% reduced chance to be critically hit by melee attacks, the threat generated by all your actions is massively increased, and your Feint ability is replaced with Tease, which Taunts the target to attack you.\nTaunts the target to attack you, but has no effect if the target is already attacking you.",
        "icon": "ability_rogue_bloodyeye"
      },
      {
        "Name": "Quick Draw",
        "Description": "Draw your ranged weapon and fire a quick shot at an enemy, causing normal ranged weapon damage and reducing the target's movement speed by 50% for 6 sec. Awards 1 combo point.\nQuick Draw benefits from all talents and effects that trigger from or modify Sinister Strike.",
        "icon": "inv_musket_02"
      },
      {
        "Name": "Slaughter from the Shadows",
        "Description": "Reduces the Energy cost of your Backstab and Ambush abilities by 20. \n\nEngrave Gloves - Mutilate\nDoes not apply to Mutilate\n\nDoes not apply to abilities learned from other runes.",
        "icon": "ability_rogue_slaughterfromtheshadows"
      }
    ],
    "Waist": [
      {
        "Name": "Shuriken Toss",
        "Description": "Throw a shuriken at your enemy dealing damage equal to 15% of your Attack Power, and also strike up to 4 additional nearby targets. Awards 1 combo point.",
        "icon": "ability_upgrademoonglaive"
      },
      {
        "Name": "Shadowstep",
        "Description": "Attempts to step through the shadows and reappear behind your enemy and increases movement speed by 70% for 3 sec.",
        "icon": "ability_rogue_shadowstep"
      },
      {
        "Name": "Poisoned Knife",
        "Description": "Instantly throw your off-hand weapon to deal normal off-hand weapon damage with a 100% chance to apply the poison from your off-hand weapon to the target. Awards 1 combo point.\n\nPoisoned Knife benefits from all talents and effects that trigger from or modify Sinister Strike.",
        "icon": "inv_weapon_shortblade_59"
      }
    ],
    "Legs": [
      {
        "Name": "Between the Eyes",
        "Description": "Ranged Finishing move that causes damage per combo point, increased by Attack Power, and Stuns the target:\n\n1 point: 148 to 226 damage, 1 sec Stun\n2 points: 238 to 364 damage, 2 sec Stun\n3 points: 329 to 503 damage, 3 sec Stun\n4 points: 420 to 641 damage, 4 sec Stun\n5 points: 510 to 780 damage, 5 sec Stun\n\nCooldown shared with Kidney Shot.",
        "icon": "inv_weapon_rifle_01"
      },
      {
        "Name": "Blade Dance",
        "Description": "Finishing move that increases your Parry chance by 10%. Lasts longer per combo point:\n\n1 point : 14 seconds\n2 points: 18 seconds\n3 points: 22 seconds\n4 points: 26 seconds\n5 points: 30 seconds",
        "icon": "ability_parry"
      },
      {
        "Name": "Envenom",
        "Description": "Finishing move that deals instant poison damage based on your Deadly Poison doses on the target. Following the Envenom attack you have a 75% increased frequency of applying Instant Poison for 1 sec plus an additional 1 sec per combo point. One dose is activated per combo point:\n\n1 dose: 153 damage\n2 doses: 306 damage\n3 doses: 459 damage\n4 doses: 612 damage\n5 doses: 765 damage",
        "icon": "ability_rogue_disembowel"
      }
    ],
    "Feet": [
      {
        "Name": "Master of Subtlety",
        "Description": "Attacks made while stealthed and for 6 seconds after breaking stealth cause an additional 10% damage.",
        "icon": "ability_rogue_masterofsubtlety"
      },
      {
        "Name": "Rolling with the Punches",
        "Description": "Each time you Dodge or Parry, you gain 6% increased Health, stacking up to 5 times.",
        "icon": "ability_rogue_quickrecovery"
      },
      {
        "Name": "Waylay",
        "Description": "Your Ambush and Backstab hits unbalance your target, increasing the time between their melee attacks by 10%, and reducing movement speed by 50% for 8 sec.",
        "icon": "ability_rogue_waylay"
      }
    ],
    "Hands": [
      {
        "Name": "Mutilate",
        "Description": "Instantly attacks with both weapons for 100% weapon damage plus an additional 108 with each weapon. Damage is increased by 20% against Poisoned targets. Awards 2 combo points.\n\nMutilate benefits from all talents and effects that trigger from or modify Backstab unless otherwise specified.",
        "icon": "ability_rogue_shadowstrikes"
      },
      {
        "Name": "Shadowstrike",
        "Description": "Teleport behind your target and strike, causing 150% weapon damage to the target. Must be stealthed. Awards 1 combo point.",
        "icon": "ability_theblackarrow"
      },
      {
        "Name": "Saber Slash",
        "Description": "Viciously slash an enemy for 100% weapon damage, and cause the target to bleed for 25 damage every 2 sec for 12 sec, stacking up to 3 times. Awards 1 combo point.\n\nSaber Slash benefits from all talents and effects that trigger from or modify Sinister Strike.",
        "icon": "inv_1h_haremmatron_d_01"
      },
      {
        "Name": "Shiv",
        "Description": "Instantly attack with your off-hand weapon to deal normal off-hand weapon damage with a 100% chance to apply the poison from your off-hand weapon to the target. Slower weapons require more energy. Awards 1 combo point.\n\nShiv benefits from all talents and effects that trigger from or modify Sinister Strike.",
        "icon": "inv_throwingknife_04"
      },
      {
        "Name": "Main Gauche",
        "Description": "Instantly strike with your off-hand weapon for normal off-hand weapon damage and increase your chance to parry by 10% for 10 sec. Awards 3 combo points.\n\nMain Gauche benefits from all talents and effects that trigger from or modify Sinister Strike.",
        "icon": "spell_deathknight_spelldeflection"
      }
    ],
    "Head_Phase_3": [
      {
        "Name": "Focused Attacks",
        "Description": "You gain 2 Energy every time you deal a melee or ranged critical strike.",
        "icon": "ability_rogue_focusedattacks"
      },
      {
        "Name": "Combat Potency",
        "Description": "You have a 20% chance to gain 15 Energy every time you deal melee damage with your off-hand weapon.",
        "icon": "inv_weapon_shortblade_38"
      },
      {
        "Name": "Honor Among Thieves",
        "Description": "When any player in your party critically hits with a spell or ability, you gain a combo point on your current target. This effect cannot occur more than once every second.",
        "icon": "ability_rogue_honoramongstthieves"
      }
    ],
    "Wrists_Phase_3": [
      {
        "Name": "Cut to the Chase",
        "Description": "Your Eviscerate and Envenom abilities refresh either your Slice and Dice or your Blade Dance duration to its 5 combo point maximum. If both are active, only the one with the shortest remaining duration will be refreshed.",
        "icon": "ability_rogue_cuttothechase"
      },
      {
        "Name": "Carnage",
        "Description": "Your abilities deal 20% increased damage to targets afflicted by one of your Bleed effects.",
        "icon": "ability_rogue_bloodsplatter"
      },
      {
        "Name": "Unfair Advantage",
        "Description": "Whenever you dodge an attack you gain an Unfair Advantage, striking back for 100% of your main hand weapon's damage. This cannot occur more than once per second.",
        "icon": "ability_rogue_unfairadvantage"
      }
    ]
  }