{
    "Chest": [
      {
        "Name": "Dual Wield Specialization",
        "Description": "Increases your chance to hit with both spells and melee attacks by 10% while dual wielding, your Stormstrike ability now hits with both weapons while dual wielding, and increases the damage done by your offhand weapon by 50%.",
        "icon": "ability_dualwieldspecialization"
      },
      {
        "Name": "Shield Mastery",
        "Description": "Each time you Block, you regenerate mana equal to 8% of your maximum mana and you gain Armor equal to 30% of your shield's armor value, stacking up to 5 times. You also always gain 10% increased chance to Block and 15% increased Block value.",
        "icon": "inv_shield_17"
      },
      {
        "Name": "Overload",
        "Description": "Gives your Lightning Bolt, Chain Lightning, Chain Heal, Healing Wave, and Lava Burst spells a 50% chance to cast a second, similar spell on the same target at no additional cost that causes half damage or healing and no threat.",
        "icon": "spell_nature_lightningoverload"
      },
      {
        "Name": "Healing Rain",
        "Description": "Selects the area 15 yards around target player, and heals all of target player's party members within that area for 84 every second.",
        "icon": "spell_nature_tranquility"
      },
      {
        "Name": "Two-Handed Mastery",
        "Description": "Each time you strike an enemy with a two-handed weapon, you gain 30% attack speed with two-handed weapons, 10% increased Attack Power, and 10% increased chance to hit with spells for 10 sec. This effect is lost if you strike an enemy with a one-handed weapon.",
        "icon": "spell_fire_enchantweapon"
      }
    ],
    "Waist": [
      {
        "Name": "Maelstrom Weapon",
        "Description": "When you deal damage with a melee attack, you have a chance to reduce the cast time and mana cost of your next Lightning Bolt, Chain Lightning, Lesser Healing Wave, Healing Wave, Chain Heal, or Lava Burst spell by 20%. Chance increased by 50% while your main hand weapon is enchanted with Windfury Weapon. Stacks up to 5 times. Lasts 30 sec.",
        "icon": "spell_shaman_maelstromweapon"
      },
      {
        "Name": "Fire Nova",
        "Description": "Gain the Fire Nova ability, replacing your Fire Nova Totem: Your Fire Nova Totem spell is replaced with Fire Nova, which causes your current Fire totem to emit damage at its location.",
        "icon": "spell_fire_sealoffire"
      },
      {
        "Name": "Power Surge",
        "Description": "Each time Flame Shock deals damage, it has a 5% chance to reset the cooldown on Lava Burst and Chain Lightning and make the next Lava Burst, Chain Heal, or Chain Lightning within 10 sec instant. Additionally, every 5 sec you gain mana equal to 15% of your Intellect.",
        "icon": "inv_misc_orb_05"
      }
    ],
    "Legs": [
      {
        "Name": "Ancestral Guidance",
        "Description": "For the next 10 sec, 25% of your damage is converted to healing on up to 3 nearby party members, and 100% of your healing is converted to damage on your most recent Flame Shock target.",
        "icon": "ability_druid_lunarguidance"
      },
      {
        "Name": "Earth Shield",
        "Description": "Protects the target with an earthen shield, reducing casting or channeling time lost when damaged by 30% and causing attacks to heal the shielded target for 309. This effect can only occur once every few seconds. 9 charges. Lasts 10 min. Earth Shield can only be placed on one target at a time and only one Elemental Shield can be active on a target at a time.",
        "icon": "spell_nature_skinofearth"
      },
      {
        "Name": "Way of Earth",
        "Description": "While Rockbiter Weapon is active on your main hand weapon and you have a shield equipped, you deal 50% increased threat, gain 30% increased health, take 10% reduced damage, gain 6% reduced chance to be critically hit by melee attacks, and Earth Shock taunts targets to attack you and has a separate cooldown from other Shock spells but has its range reduced to melee range.",
        "icon": "spell_nature_earthquake"
      },
      {
        "Name": "Shamanistic Rage",
        "Description": "Reduces all damage you take by 20% and you regenerate mana equal to 5% of your maximum mana every second for 15 sec. Your party and raid members within 40 yards will also receive 20% of the mana you receive this way.",
        "icon": "spell_nature_shamanrage"
      }
    ],
    "Hands": [
      {
        "Name": "Water Shield",
        "Description": "The caster is surrounded by 3 globes of water, granting 1% of your maximum mana per 5 sec. When a spell, melee or ranged attack hits the caster, 4% of maximum mana is restored to the caster. This expends one water globe. Only one globe will activate every few seconds. Lasts 10 min. Only one Elemental Shield can be active on the Shaman at any one time.",
        "icon": "ability_shaman_watershield"
      },
      {
        "Name": "Lava Burst",
        "Description": "You hurl molten lava at the target, dealing 786 to 1,014 Fire damage. If your Flame Shock is on the target, Lava Burst will deal a critical strike.",
        "icon": "spell_shaman_lavaburst"
      },
      {
        "Name": "Lava Lash",
        "Description": "You charge your off-hand weapon with lava, instantly dealing 100% off-hand Weapon damage. Damage is increased by 125% if your off-hand weapon is enchanted with Flametongue.",
        "icon": "ability_shaman_lavalash"
      },
      {
        "Name": "Molten Blast",
        "Description": "Blast up to 4 enemies in a cone in front of you for 146 to 206 Fire damage. This ability generates a high amount of threat. Flame Shock periodic damage has a 10% chance to reset the cooldown on Molten Blast.",
        "icon": "spell_shaman_lavaflow"
      }
    ],
    "Head (Phase 3)": [
      {
        "Name": "Mental Dexterity",
        "Description": "Dealing damage with your melee weapons increases your Attack Power by 100% of your Intellect, and your spell damage and healing by 30% of your total Attack Power for 1 min.",
        "icon": "spell_nature_mentalquickness"
      },
      {
        "Name": "Burn",
        "Description": "Your Flame Shock now strikes up to 3 targets.",
        "icon": "spell_fire_moltenblood"
      },
      {
        "Name": "Tidal Waves",
        "Description": "When you cast Chain Heal or Riptide you gain 2 charges of Tidal Waves, which reduces the cast time of your Healing Wave by 30% and increases the critical effect chance of your Lesser Healing Wave by 25%.",
        "icon": "spell_shaman_tidalwaves"
      }
    ],
    "Wrists (Phase 3)": [
      {
        "Name": "Riptide",
        "Description": "Heals a friendly target for 635 to 691 and another 674 over 15 sec. Your next Chain Heal cast on that primary target within 15 sec will consume the healing over time effect and increase the amount of the Chain Heal by 25%. This spell also triggers Ancestral Awakening.",
        "icon": "spell_nature_riptide"
      },
      {
        "Name": "Rolling Thunder",
        "Description": "Lightning Bolt and Chain Lightning have a 30% chance to add an additional charge to your active Lightning Shield, up to a maximum of 9 Charges. Earth Shock now releases all Lightning Shield charges above 3, dealing their damage to the target, and energizing you for 2% of your maximum mana per charge released.",
        "icon": "spell_nature_unrelentingstorm"
      },
      {
        "Name": "Static Shock",
        "Description": "Your Lightning Shield now has 9 charges, and your melee attacks have a 6% chance to trigger one of those charges, immediately damaging your target.",
        "icon": "spell_shaman_staticshock"
      },
      {
        "Name": "Overcharged",
        "Description": "Your Lightning Shield never loses charges, now has a 1 sec cooldown, and deals damage to all enemies within 8 yards.",
        "icon": "spell_fire_blueflamering"
      }
    ]
  }