{
    "Chest": [
      {
        "Name": "Lake of Fire",
        "Description": "Rain of Fire also leaves a Lake of Fire on the ground after you channel it for its full duration that increases all Fire damage you deal and your Demon pet deals to affected enemies by 50% for 15 sec.",
        "icon": "spell_fire_selfdestruct"
      },
      {
        "Name": "Master Channeler",
        "Description": "Your Drain Life is no longer channeled, lasts 15 sec with a 15 sec cooldown, costs 100% more mana, and heals you for 50% more each time it deals damage.",
        "icon": "spell_shadow_lifedrain"
      },
      {
        "Name": "Soul Siphon",
        "Description": "Increases the amount drained by your Drain Life and Drain Soul spells by an additional 6% for each of your Warlock Shadow effects afflicting the target, up to a maximum of 18% additional effect.",
        "icon": "spell_shadow_lifedrain02"
      },
      {
        "Name": "Demonic Tactics",
        "Description": "Increases the melee and spell critical strike chance of you and your pet by 10%.",
        "icon": "spell_shadow_demonictactics"
      }
    ],
    "Waist": [
      {
        "Name": "Invocation",
        "Description": "Refreshing Corruption, Immolate, Curse of Agony, or Siphon Life when it has less than 6 seconds duration remaining will cause you to deal instant damage to the target equal to the spell's remaining periodic damage.",
        "icon": "spell_shadow_corpseexplode"
      },
      {
        "Name": "Grimoire of Synergy",
        "Description": "Recite from a dark tome, granting damage done by you or your summoned demon a 5% chance to increase the damage done by the other by 25% for 15 sec. Recitation lasts 30 min.",
        "icon": "inv_misc_book_06"
      },
      {
        "Name": "Shadow and Flame",
        "Description": "Your critical strikes with Fire and Shadow spells increase your Fire and Shadow damage done by 10% for 10 sec.",
        "icon": "spell_fire_playingwithfire"
      }
    ],
    "Legs": [
      {
        "Name": "Everlasting Affliction",
        "Description": "Drain Life, Drain Soul, Shadowbolt, Shadow Cleave, Searing Pain, Incinerate, and Haunt refresh the duration of your Corruption on the target back to its maximum duration.",
        "icon": "ability_warlock_everlastingaffliction"
      },
      {
        "Name": "Incinerate",
        "Description": "Burn your enemy for 358 to 416 damage and increase all Fire damage you deal by 25% for the next 15 sec.",
        "icon": "spell_fire_burnout"
      },
      {
        "Name": "Demonic Grace",
        "Description": "Surge with fel energy, increasing your pet's and your own dodge chance by 30%, and your chance to critically strike with all attacks by 30%. Lasts 6 sec.",
        "icon": "ability_warlock_demonicpower"
      },
      {
        "Name": "Demonic Pact",
        "Description": "Your pet's critical strikes apply the Demonic Pact effect to your party members for 45 sec. Demonic Pact increases spell damage and healing by 10% of your spell damage or (60 / 2), whichever is higher. Does not work on Subjugated demons.",
        "icon": "spell_shadow_demonicpact"
      }
    ],
    "Feet": [
      {
        "Name": "Dance of the Wicked",
        "Description": "You and your demon pet gain dodge chance equal to your spell critical strike chance each time you deal a critical strike to an enemy, and also both regain 2% of maximum mana.",
        "icon": "ability_warlock_eradication"
      },
      {
        "Name": "Demonic Knowledge",
        "Description": "Increases your spell damage and healing by a value equal to 10% of your Demon pet's total Stamina plus Intellect.",
        "icon": "spell_shadow_metamorphosis"
      },
      {
        "Name": "Shadowflame",
        "Description": "Targets in a cone in front of the caster take 103 Shadow damage and an additional 155 Fire damage over 8 sec. This effect can be consumed with Conflagrate.",
        "icon": "ability_warlock_shadowflame"
      }
    ],
    "Hands": [
      {
        "Name": "Metamorphosis",
        "Description": "Transform into a Demon, increasing Armor by 500%, reducing the chance you will be critically hit by 6%, increasing your threat by 50%, increasing mana gained from Life Tap by 100%, transforming the functionality of some of your abilities, and granting some new abilities:\n\nSearing Pain: Now instant.\n\nShadow Bolt: Becomes Shadow Cleave, a Shadow melee attack that hits up to 3 nearby enemies, but has a 6 sec cooldown.\n\nFear: Replaced with Menace.\nTaunts the target to attack you, but has no effect if the target is already attacking you.\n\nDemon Charge\nCharge an enemy and stun it for 1 sec. Cannot be used in combat.\n\nDemonic Howl\nForces all nearby enemies to focus attacks on you for 6 sec.",
        "icon": "spell_shadow_demonform"
      },
      {
        "Name": "Shadow Bolt Volley",
        "Description": "Your Shadow Bolt now strikes up to 5 targets within a chain distance of 10 yards, but for 20% reduced damage.",
        "icon": "spell_shadow_shadetruesight"
      },
      {
        "Name": "Chaos Bolt",
        "Description": "Sends a bolt of chaotic fire at the enemy, dealing 841 to 1,066 Fire damage. Chaos Bolt always hits, cannot be resisted, and its knowledge causes all your Fire spells to pierce through absorption effects. Chaos Bolt gains a high chance to be resisted when used against monsters 4 or more levels above your level.",
        "icon": "ability_warlock_chaosbolt"
      },
      {
        "Name": "Haunt",
        "Description": "Unleash a ghostly soul on an enemy, dealing 404 to 475 damage, and increasing all Shadow damage over time you deal to that target by 20%. When the Haunt ends or is dispelled, you will be healed for all the damage it dealt to your target.",
        "icon": "ability_warlock_haunt"
      }
    ],
    "Head_Phase_3": [
      {
        "Name": "Pandemic",
        "Description": "Periodic damage from your Corruption, Unstable Affliction, Curse of Agony, Immolate, Curse of Doom, and Siphon Life abilities can now be critical strikes.",
        "icon": "spell_shadow_unstableaffliction_2"
      },
      {
        "Name": "Backdraft",
        "Description": "Your Conflagrate ability also grants 30% spellcasting haste for 10 sec.",
        "icon": "ability_warlock_backdraft"
      },
      {
        "Name": "Vengeance",
        "Description": "When activated, this ability temporarily grants you a 30% increase to your maximum health for 20 sec. After the effect expires, the health is lost. Additionally, while in Metamorphosis, Vengeance causes your wings to slow your falling speed.",
        "icon": "ability_warlock_improveddemonictactics"
      }
    ],
    "Wrists_Phase_3": [
      {
        "Name": "Unstable Affliction",
        "Description": "Shadow energy slowly destroys the target, causing 483 damage over 15 sec. In addition, if the Unstable Affliction is dispelled it will cause 870 damage to the dispeller and silence them for 5 sec. Only one Unstable Affliction or Immolate per Warlock can be active on any one target.",
        "icon": "spell_shadow_unstableaffliction_3"
      },
      {
        "Name": "Summon Felguard",
        "Description": "Summons a Felguard under the command of the Warlock.\n\nThe Felguard benefits from all talents and effects that trigger from or benefit any of your other Demon minions.",
        "icon": "spell_shadow_summonfelguard"
      },
      {
        "Name": "Immolation Aura",
        "Description": "Burns nearby enemies for 32 damage every 2 seconds, and reduces all magic damage taken by 10%. Lasts until cancelled.",
        "icon": "spell_fire_felimmolation"
      }
    ]
  }