{
  "Chest": [
    {
      "Name": "Flagellation",
      "Description": "Gain a 25% bonus to Physical damage done for 12 sec after activating Bloodrage or Berserker Rage.",
      "icon": "ability_warrior_intensifyrage"
    },
    {
      "Name": "Blood Frenzy",
      "Description": "Each time you deal Bleed damage, you gain 3 Rage.",
      "icon": "ability_warrior_bloodfrenzy"
    },
    {
      "Name": "Raging Blow",
      "Description": "A ferocious strike that deals 80% weapon damage, but can only be used while Enrage, Berserker Rage, or Bloodrage is active.",
      "icon": "ability_hunter_swiftstrike"
    },
    {
      "Name": "Warbringer",
      "Description": "Your Charge, Intercept, and Intervene abilities are now usable while in combat and in any stance, and will all remove movement impairing effects when activated.",
      "icon": "ability_warrior_warbringer"
    }
  ],
  "Waist": [
    {
      "Name": "Blood Surge",
      "Description": "Heroic Strike, Bloodthirst, and Whirlwind have a 30% chance to make your next Slam within 15 sec instant and cost no Rage.",
      "icon": "ability_warrior_bloodsurge"
    },
    {
      "Name": "Focused Rage",
      "Description": "Reduces the rage cost of your offensive abilities by 3.",
      "icon": "ability_warrior_focusedrage"
    },
    {
      "Name": "Precise Timing",
      "Description": "Slam is now instant but has a 6 sec cooldown.",
      "icon": "inv_misc_pocketwatch_01"
    }
  ],
  "Legs": [
    {
      "Name": "Furious Thunder",
      "Description": "Thunder Clap now increases the time between attacks by an additional 6%, can be used in any stance, deals 100% increased damage, and deals 50% increased threat.",
      "icon": "ability_thunderclap"
    },
    {
      "Name": "Consumed by Rage",
      "Description": "Enrages you and grants you a 10% melee damage bonus for 12 sec or up to a maximum of 12 swings after you exceed 80 Rage.",
      "icon": "spell_nature_shamanrage"
    },
    {
      "Name": "Frenzied Assault",
      "Description": "While wielding 2-handed weapons, your attack speed is increased by 20%.",
      "icon": "ability_warrior_unrelentingassault"
    }
  ],
  "Feet": [
    {
      "Name": "Rallying Cry",
      "Description": "Let loose a rallying cry, granting all party and raid members within 40 yards 15% increased maximum health for 10 sec.",
      "icon": "ability_warrior_commandingshout"
    },
    {
      "Name": "Enraged Regeneration",
      "Description": "Heals you for 30% of your maximum health over 10 sec, but can only be used while Enrage, Berserker Rage, or Bloodrage is active. Useable while Stunned.",
      "icon": "ability_hunter_harass"
    },
    {
      "Name": "Intervene",
      "Description": "Run at high speed towards a party member, intercepting the next melee or ranged attack made against them as well as reducing their total threat by 10%.",
      "icon": "ability_warrior_victoryrush"
    },
    {
      "Name": "Gladiator Stance",
      "Description": "An aggressive stance that increases damage while you are wearing a shield by 10% and increases block chance by 10%, but reduces armor by 30% and threat generated by 10%. While wearing a shield in Gladiator Stance, you may use all abilities that are restricted to other stances.",
      "icon": "achievement_featsofstrength_gladiator_08"
    }
  ],
  "Hands": [
    {
      "Name": "Victory Rush",
      "Description": "Instantly attack the target causing (1 + 500 * 45 / 100) damage and healing you for 10% of your maximum health. Only useable within 20 sec after you kill an enemy that yields experience or honor.",
      "icon": "ability_warrior_devastate"
    },
    {
      "Name": "Endless Rage",
      "Description": "You generate 25% more Rage from all damage you deal.",
      "icon": "ability_warrior_endlessrage"
    },
    {
      "Name": "Devastate",
      "Description": "While you are in Defensive Stance and have a shield equipped, Sunder Armor also deals damage equal to 150% of your equipped weapon's damage per second, increased by 10% per application of Sunder Armor already on the target.",
      "icon": "inv_sword_11"
    },
    {
      "Name": "Single-Minded Fury",
      "Description": "While dual-wielding, your Physical damage and movement speed are increased by 10%.",
      "icon": "ability_warrior_incite"
    },
    {
      "Name": "Quick Strike",
      "Description": "A reckless instant melee attack with your two-handed weapon dealing 50 to 100 physical damage. This ability benefits from and triggers all effects associated with Heroic Strike.",
      "icon": "inv_axe_03"
    }
  ],
  "Head_Phase_3": [
    {
      "Name": "Shield Mastery",
      "Description": "Increases all physical damage you deal by 10% while you have a shield equipped, and reduces the duration of all Disarm effects used against you by 50%. This does not stack with other Disarm duration reducing effects.",
      "icon": "ability_warrior_shieldguard"
    },
    {
      "Name": "Taste for Blood",
      "Description": "Whenever your Rend ability causes damage, your Overpower ability will activate for 9 sec or 1 attack. This effect will not occur more than once every 6 sec.",
      "icon": "ability_rogue_hungerforblood"
    },
    {
      "Name": "Vigilance",
      "Description": "Focus your protective gaze on a party or raid member, reducing their damage taken by 3% and transferring 10% of the threat they cause to you. In addition, each time they are hit by an attack your Taunt cooldown is refreshed. Lasts 30 min. This effect can only be on one target at a time.",
      "icon": "ability_warrior_vigilance"
    }
  ],
  "Wrists_Phase_3": [
    {
      "Name": "Rampage",
      "Description": "Warrior goes on a rampage, increasing attack power by 2% and causing most successful melee attacks to increase attack power by an additional 2%. This effect will stack up to 5 times. Lasts 30 sec. This ability can only be used after scoring a critical hit.",
      "icon": "ability_warrior_rampage"
    },
    {
      "Name": "Sword and Board",
      "Description": "When your Devastate and Revenge abilities deal damage they have a 30% chance of refreshing the cooldown of your Shield Slam ability and reducing its Rage cost by 100% for 5 sec.",
      "icon": "ability_warrior_swordandboard"
    },
    {
      "Name": "Wrecking Crew",
      "Description": "Your melee critical hits Enrage you, increasing the critical strike damage of all your attacks by 10% for 6 sec.",
      "icon": "ability_warrior_trauma"
    }
  ]
}
